doom/config.el

;; after org-mode loads
(after! 'org
  (add-hook 'org-mode-hook (lambda () (org-bullets-mode 1)))
  (setq org-directory "~/Org/"
        org-agenda-files '("~/Org/agenda.org")
        org-default-notes-file (expand-file-name "notes.org" org-directory)
        org-ellipsis " ▼ "
        org-log-done 'time
        org-hide-emphasis-markers t)
  (org-babel-do-load-languages 'org-babel-load-languages
                               (append org-babel-load-languages
                                       '(('awk             . t)
                                         ('browser         . t)
                                         ('C               . t)
                                         ('C++             . t)
                                         ('csharp          . t)
                                         ('css             . t)
                                         ('haskell         . t)
                                         ('http            . t)
                                         ('java            . t)
                                         ('js              . t)
                                         ('kotlin          . t)
                                         ('lisp            . t)
                                         ('lua             . t)
                                         ('make            . t)
                                         ('mongo           . t)
                                         ('org             . t)
                                         ;;(php             . t)  ; not currently supported?
                                         ('python          . t)
                                         ('R               . t)
                                         ('ruby            . t)
                                         ('sass            . t)
                                         ('sed             . t)
                                         ('shell           . t)
                                         ('sql             . t)
                                         ('sqlite          . t)
                                         ('typescript      . t)))))

;; (custom-set-faces
;;   '(org-level-1 ((t (:inherit outline-1 :height 1.2))))
;;   '(org-level-2 ((t (:inherit outline-2 :height 1.0))))
;;   '(org-level-3 ((t (:inherit outline-3 :height 1.0))))
;;   '(org-level-4 ((t (:inherit outline-4 :height 1.0))))
;;   '(org-level-5 ((t (:inherit outline-5 :height 1.0)))))
