doom/config.el



(use-package mu4e
  ;;:load-path "/usr/share/emacs/site-lisp/mu4e"
  :defer 20
  :config
  ;; This is set to 't' to avoid mail syncing issues when using mbsync
  (setq mu4e-change-filenames-when-moving t)
  ;; Refresh mail using mbsync every 10 minutes
  (setq mu4e-update-interval (* 10 60))
  (setq mu4e-get-mail-command "mbsync -a")
  (setq mu4e-maildir "~/Mail")

  ;; set message-send-mail-function to use email providers smtp service through smtpmail package
  (setq message-send-mail-function 'smtpmail-send-it)

  ;; multiple accounts (contexts)
  (setq mu4e-contexts
        (list
         ;; create chrisg8691-gmail account context
         (make-mu4e-context
          :name "achrisg8691-gmail"
          :match-func
            (lambda (msg)
              (when msg
                (string-prefix-p "/chrisg8691-gmail" (mu4e-message-field msg :maildir))))
          :vars '((user-mail-address            . "chrisg8691@gmail.com")
                  (user-full-name               . "Chris Girvin")
                  (smtpmail-smtp-server         . "smtp.gmail.com")
                  (smtpmail-smtp-service        . 465)
                  (smtpmail-stream-type         . ssl)
                  (mu4e-drafts-folder           . "/chrisg8691-gmail/[Gmail].Drafts")
                  (mu4e-sent-folder             . "/chrisg8691-gmail/[Gmail].Sent Mail")
                  (mu4e-refile-folder           . "/chrisg8691-gmail/[Gmail].All Mail")
                  (mu4e-trash-folder            . "/chrisg8691-gmail/[Gmail].Trash")))

         ;; create bugbounty.chrisg8691-gmail account context
         (make-mu4e-context
          :name "bbugbounty.chrisg8691-gmail"
          :match-func
            (lambda (msg)
              (when msg
                (string-prefix-p "/bugbounty.chrisg8691-gmail" (mu4e-message-field msg :maildir))))
          :vars '((user-mail-address            . "bugbounty.chrisg8691@gmail.com")
                  (user-full-name               . "Chris Girvin")
                  (smtpmail-smtp-server         . "smtp.gmail.com")
                  (smtpmail-smtp-service        . 465)
                  (smtpmail-stream-type         . ssl)
                  (mu4e-drafts-folder           . "/bugbounty.chrisg8691-gmail/[Gmail].Drafts")
                  (mu4e-sent-folder             . "/bugbounty.chrisg8691-gmail/[Gmail].Sent Mail")
                  (mu4e-refile-folder           . "/bugbounty.chrisg8691-gmail/[Gmail].All Mail")
                  (mu4e-trash-folder            . "/bugbounty.chrisg8691-gmail/[Gmail].Trash")))

         ;; create chrisg8691-outlook account context
         (make-mu4e-context
          :name "cchrisg8691-outlook"
          :match-func
            (lambda (msg)
              (when msg
                (string-prefix-p "/chrisg8691-outlook" (mu4e-message-field msg :maildir))))
          :vars '((user-mail-address            . "chrisg8691@outlook.com")
                  (user-full-name               . "Chris Girvin")
                  (smtpmail-smtp-server         . "smtp.office365.com")
                  (smtpmail-smtp-service        . 587)
                  (smtpmail-stream-type         . starttls)
                  (mu4e-drafts-folder           . "/chrisg8691-outlook/Drafts")
                  (mu4e-refile-folder           . "/chrisg8691-outlook/Archive")
                  (mu4e-trash-folder            . "/chrisg8691-outlook/Deleted")))

         ;; create bugbounty.chrisg8691-outlook account context
         (make-mu4e-context
          :name "dbugbounty.chrisg8691-outlook"
          :match-func
            (lambda (msg)
              (when msg
                (string-prefix-p "/bugbounty.chrisg8691-outlook" (mu4e-message-field msg :maildir))))
          :vars '((user-mail-address            . "bugbounty.chrisg8691@outlook.com")
                  (user-full-name               . "Chris Girvin")
                  (smtpmail-smtp-server         . "smtp.office365.com")
                  (smtpmail-smtp-service        . 587)
                  (smtpmail-stream-type         . starttls)
                  (mu4e-drafts-folder           . "/bugbounty.chrisg8691-outlook/Drafts")
                  (mu4e-refile-folder           . "/bugbounty.chrisg8691-outlook/Archive")
                  (mu4e-trash-folder            . "/bugbounty.chrisg8691-outlook/Deleted")))))

  ;; shortcuts for main acct
  (setq mu4e-maildir-shortcuts
        '(("/chrisg8691-gmail/Inbox"                    . ?i)
          ("/bugbounty.chrisg8691-gmail/Inbox"          . ?1)
          ("/chrisg8691-outlook/Inbox"                  . ?2)
          ("/bugbounty.chrisg8691-outlook/Inbox"        . ?3)
          ("/chrisg8691-gmail/[Gmail].Sent Mail"        . ?s)
          ("/chrisg8691-gmail/[Gmail].Trash"            . ?t)
          ("/chrisg8691-gmail/[Gmail].Drafts"           . ?d)
          ("/chrisg8691-gmail/[Gmail].All Mail"         . ?a)))

  ;; set context policies
  ;; (setq mu4e-compose-context-policy 'ask)
  ;; (setq mu4e-context-policy "chrisg8691-gmail")

  ;; run mu4e in the background
  (mu4e t))

;; distrotube config need to look into this more
;;(add-to-list 'load-path "/usr/share/emacs/site-lisp/mu4e")
;;(require 'smtpmail)
;; I have my mbsyncrc in a different folder on my system, to keep it separate from the
;; mbsyncrc available publicly in my dotfiles. You MUST edit the following line.
;; Be sure that the following command is: "mbsync -c ~/.config/mu4e/mbsyncrc -a"
;; (setq mu4e-get-mail-command "mbsync -c ~/.config/mu4e/mbsyncrc -a"
;;       mu4e-update-interval  300
;;       mu4e-main-buffer-hide-personal-addresses t
;;       message-send-mail-function 'smtpmail-send-it
;;       starttls-use-gnutls t
;;       smtpmail-starttls-credentials '(("smtp.1and1.com" 587 nil nil))
;;       mu4e-sent-folder "/account-1/Sent"
;;       mu4e-drafts-folder "/account-1/Drafts"
;;       mu4e-trash-folder "/account-1/Trash"
;;       mu4e-maildir-shortcuts
;;       '(("/account-1/Inbox"      . ?i)
;;         ("/account-1/Sent Items" . ?s)
;;         ("/account-1/Drafts"     . ?d)
;;         ("/account-1/Trash"      . ?t)))

(use-package emojify
  :hook (general-after-init . global-emojify-mode))

(defun efs/lookup-password (&rest keys)
  (let ((result (apply #'auth-source-search keys)))
    (if result
        (funcall (plist-get (car result) :secret))
      nil)))
